{
  "id": "13",
  "title": "Switch, case and default",
  "content": "You already know how to shape the control flow of a program using if-else statements.\nThis is a very handy operator. But let's imagine that you have a choice of 5, 10, or 20 options. Each time you will have to write a complex structure of if/else operators. And for each such operator, you need 2 pairs of curly braces. That's a lot of them, isn't it? But this can be avoided. In this topic, you will learn an alternative way to deal with multiple choices.\n\n\\bold Switch, case, and default\n\nLet's still first try to implement something using if-else operators. For example, choosing an action from a game menu. To do that, you can use a conditional statement with multiple branches, as shown below.\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int choice;\n    printf(\"Game Menu\\n\");\n    printf(\"1. New Game\\n\");\n    printf(\"2. Continue\\n\");\n    printf(\"3. Settings\\n\");\n    printf(\"4. Quit\\n\");\n    printf(\"Choose an option: \");\n    scanf(\"%d\", &choice);\n\n    if (choice == 1) {\n        printf(\"Starting a new game...\\n\");\n    } else if (choice == 2) {\n        printf(\"Continuing the game...\\n\");\n    } else if (choice == 3) {\n        printf(\"Opening settings...\\n\");\n    } else if (choice == 4) {\n        printf(\"Exiting the game...\\n\");\n    } else {\n        printf(\"Invalid choice. Please try again.\\n\");\n    }\n    return 0;\n}\nc\n\nOf course, this code handles the task. But if your conditional statement has many branches, it can be difficult to understand. And here, the switch statement comes to the rescue.\n\nThe switch statement provides a way to choose between multiple options (case) based on the value of a single variable (not an expression!). The variable can be an integer, character, string, or enumeration (enum). You will study the last two types in more detail in the following topics.\n\nWith the switch statement, the previous code will look like this:\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int choice;\n    printf(\"Game Menu\\n\");\n    printf(\"1. New Game\\n\");\n    printf(\"2. Continue\\n\");\n    printf(\"3. Settings\\n\");\n    printf(\"4. Quit\\n\");\n    printf(\"Choose an option: \");\n    scanf(\"%d\", &choice);\n\n    switch (choice) {\n        case 1:\n            printf(\"Starting a new game...\\n\");\n            break;\n        case 2:\n            printf(\"Continuing the game...\\n\");\n            break;\n        case 3:\n            printf(\"Opening settings...\\n\");\n            break;\n        case 4:\n            printf(\"Exiting the game...\\n\");\n            break;\n        default:\n            printf(\"Invalid choice. Please try again.\\n\");\n            break;\n    }\n    return 0;\n}\nc\n\nAs you can see, this code is well-structured and easier to read than the if/else conditional statement. We haven't explained the keywords switch, case, and break yet, but you can already guess what they mean.\n\n\\bold Switch under a microscope\n\nLet's now take a closer look at switch and its components.\n\nc\n\nswitch (choice) {\n    case 1:\n        printf(\"Starting a new game...\\n\");\n        break;\n    case 2:\n        printf(\"Continuing the game...\\n\");\n        break;\n    case 3:\n        printf(\"Opening settings...\\n\");\n        break;\n    case 4:\n        printf(\"Exiting the game...\\n\");\n        break;\n    default:\n        printf(\"Invalid choice. Please try again.\\n\");\n        break;\n}\nc\n\n    switch (choice) { } - In C, the switch statement performs different actions based on the value of a variable or expression. It starts with the keyword switch followed by the variable or expression being evaluated in parentheses. The code block enclosed in curly braces { } contains a series of case labels that specify the possible values to compare against.\n\n    case - Within a switch statement, the case keyword defines a specific value (but not a range, unlike in C++) to compare against the variable or expression specified in the switch statement. If the value matches the case label, the corresponding code block associated with that case is executed.\n\n    break - The break statement is used within a switch statement to terminate the execution of the current case and exit the switch statement. break is optional.\n\n    default - The default keyword serves as a label within a switch statement that specifies the code to be executed if none of the case labels match the value of the evaluated expression. It is the default option when no other cases are matched. The default case is optional and can be placed anywhere within the switch block, but it is often used as the last case.\n\nAs you may have noticed (if not, please pay attention), break is optional. And this can lead to potential issues.\n\nSequential code execution is one of the trickiest aspects of a switch statement. When a case is matched (or the default case is executed), execution starts from the first statement following that case and continues until one of the following termination conditions is met:\n\n    The end of the switch block is reached.\n\n    A return statement is executed.\n\n    A break statement is executed.\n\nNote that if none of these termination conditions are met, all the cases following the matched case will be executed.\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int option = 2;\n    switch (option) {\n        case 1:\n            printf(\"This option is not suitable, we will not print this.\\n\");\n        case 2:\n            printf(\"Oh, we will print this.\\n\");\n        case 3:\n            printf(\"And we will print this too...\\n\");\n        case 4:\n            printf(\"And this too??? YES!\\n\");\n        case 5:\n            printf(\"And this 8)\\n\");\n        default:\n            printf(\"And this\\n\");\n    }\n    return 0;\n}\nc\n\nAs a result of executing the code, you will get the following:\n\nOh, we will print this.\nAnd we will print this too...\nAnd this too??? YES!\nAnd this 8)\nAnd this\n\nThis is definitely not what you need! The break statement tells the compiler that you have already done everything you wanted with a particular switch and do not intend to work with it anymore. Remember this and be careful.",
  "isCompleted": true,
  "practice": null
}