{
  "id": "9",
  "title": "Conditional loops",
  "content": "Loops are essential for repeating similar operations and simplifying a programmer's life. Computers are happy to perform any number of repetitive actions; it's a piece of cake for them. In the C programming language, there are several types of loops. In this topic, you will explore two of them: the while loop and the do-while loop.\n\n\\bold The while loop\n\nThe while loop is very similar to the conditional if statement.\n\nThe while loop consists of a block of code and a condition (a Boolean expression). If the condition is true, the code inside the block is executed. This code repeats until the condition becomes false. Since this loop checks the condition before the block is executed, this control structure is also known as a pre-test loop. You can think of the while loop as a repetitive if statement.\n\nThe basic syntax of the while loop is the following:\n\nc\n\nwhile (condition) {\n    // some code here\n    // this code will repeat as long as the condition is true\n}\nc\n\nA loop's body can contain any correct C statements, including conditional statements and even other loops (the latter are called nested loops).\n\nIt is also possible to write an infinite loop if the condition is invariably true. In C, non-zero constants are typically used for this:\n\nc\n\nwhile (1) {\n    // code will repeat indefinitely\n}\nc\n\nBut be very careful with such experiments; you need to clearly understand what you are doing and how to stop it!\n\n\\bold Example 1: The while loop\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int count = 0;\n    while (count < 5) {\n        printf(\"Count: %d\\n\", count);\n        count++;\n    }\n    return 0;\n}\nc\n\nIn this example, the while loop will continue executing the code block as long as the condition count < 5 is true. It will print the current value of count and increment it by 1 with each iteration. The loop will stop once the condition becomes false. The output will be:\n\nCount: 0\nCount: 1\nCount: 2\nCount: 3\nCount: 4\n\nNote that the condition is evaluated before each iteration, and if it is initially false, the loop will not be executed at all.\n\n\\bold Example 2: The while loop (printing letters)\n\nc\n\n#include <stdio.h>\n\nint main() {\n    char letter = 'A';\n    while (letter <= 'Z') {\n        printf(\"%c\", letter);\n        letter++;\n    }\n    return 0;\n}\nc\n\nThis program prints English letters in a single line. The program takes the first letter 'A' and then proceeds as follows: if the letter is less than or equal to 'Z', the program enters the loop's body; inside the body, it prints the current character, and letter is assigned the next letter of the alphabet.\n\nThe program prints:\n\nABCDEFGHIJKLMNOPQRSTUVWXYZ\n\nRemember that you can get the next character according to the ASCII table (standard for C) by using the increment operator.\n\n\\bold The do-while loop\n\nIn the do-while loop, the body is executed first, and the condition is tested afterwards. If the condition is true, the statements within the block are executed again. This repeats until the condition becomes false. Because do-while loops check the condition after the block is executed, this control structure is often also known as a post-test loop.\n\nIn contrast to the while loop, which tests the condition before the code within the block is executed, the do-while loop is an exit-condition loop. Therefore, the code within the block is always executed at least once.\n\nThis loop contains three parts: the do keyword, a body, and while(condition):\n\nc\n\ndo {\n    // body: do something\n} while (condition); // check condition and if true, go to body\nc\n\nA good example of its use is a program that reads data from standard input until a user enters a certain number or string.\n\n\\bold Example 3: The do-while loop\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int value;\n    printf(\"Input value: \\n\");\n    do {\n        scanf(\"%d\", &value);\n        printf(\"You entered %d\\n\", value);\n    } while (value != 0);\n    return 0;\n}\nc\n\nThis program reads integers from the standard input and displays them. The program runs until you enter the number 0. If the number 0 is entered, the program prints it and then stops. Note that, like the while loop, the do-while loop can be infinite.\n\nIn practice, the do-while loop is used less frequently than the while loop. It is used when the code inside the loop must be executed at least once.\n\nWhat makes computers so wonderful? They think quickly and never tire of repetitive tasks. Imagine having an array that contains the entire alphabet, and you want to print it line by line. Or even an array with 1000 or even a million values. If you had to print everything manually, I believe you would quickly grow tired of writing code. That's where loops come to the rescue!\n\nIn this topic, let's explore the most popular loop in programming: the for loop. It allows you to automate repetitive tasks and iterate over arrays or ranges of values without the need for manual repetition. With the for loop, you can harness the power of computers to handle large amounts of data effortlessly.\n\n\\bold The basic for-loop syntax\n\nThe for loop has the following basic syntax:\n\nc\n\nfor (initialization; condition; modification) {\n    // do something\n}\nc\n\nParts of the loop:\n\n    The initialization statement is executed once before the loop begins; usually, loop variables are initialized here.\n\n    The condition is a Boolean expression that determines the need for the next iteration; if it's false, the loop terminates.\n\n    The modification is a statement that changes the value of the loop variables; it is invoked after each iteration of the loop; usually, it uses increment or decrement to modify the loop's variable.\n\nInside the loop's body, the program can perform any correct C statements. It can even contain other loops (nested loops).\nThe order of execution for any for loop is always the same:\n\n    The initialization statement is executed.\n\n    If the condition is false, then the loop terminates.\n\n    If the condition is true, then the loop's body is executed.\n\n    The modification is performed.\n\n    Go to step 2 (check the condition).\n\nLet's write a loop for printing integer numbers from 0 to 9 on the same line.\n\nc\n\n#include <stdio.h>\n\nint main() {\n    for (int i = 0; i < 10; i++) {\n        printf(\"%d \", i);\n    }\n    return 0;\n}\nc\n\nThis code displays:\n\n0 1 2 3 4 5 6 7 8 9\n\nYou declared the iterative variable i in the loop, and each time the loop is executed, you increase it by 1 (i++). And you will display its value on the screen as long as your variable is less than 10 (i < 10).\nThe variables declared in the initialization statement are visible only inside the scope that includes all parts of the loop: the condition, the body, and the modification. Integer loop variables are often named i, j, k, or index.\n\nHere's another example. Let's calculate the sum of the integer numbers from 1 to 10000 (inclusive) using the for loop:\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int sum = 0;\n    for (int i = 1; i <= 10000; i++) {\n        sum += i;\n    }\n    printf(\"The sum is: %d\\n\", sum);\n    return 0;\n}\nc\n\nThe code displays:\n\nThe sum is: 50005000\n\nHere you carry out the same actions, only the termination conditions have changed a little (i <= 10000) and inside the loop, you do not display the result, but sum it up (sum += i;).\n\nLet's take a slightly more difficult problem and at the same time recall what you've learned before. Let's write a loop for printing the English alphabet:\n\nc\n\n#include <stdio.h>\n\nint main() {\n    char alphabet[] = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'};\n    int alphabetSize = sizeof(alphabet) / sizeof(alphabet[0]);\n    int lettersPerLine = 4;\n\n    for (int i = 0; i < alphabetSize; i++) {\n        printf(\"%c \", alphabet[i]);\n        if ((i + 1) % lettersPerLine == 0) {\n            printf(\"\\n\");\n        }\n    }\n    return 0;\n}\nc\n\nDon't rush to read further; carefully study the example. Do you understand everything? In this example, a large number of everything you have already learned is concentrated (if, %, sizeof, array, printf). Play around with the code in your IDE. If everything is clear, let's move on.\n\n\\bold Skipping parts\n\nThe initialization statement, the condition, and the modification parts are optional; the for loop might not have all of them.\nIt is possible to declare a variable outside the loop:\n\nc\n\nint i = 10;\nfor (; i > 0; i--) {\n    printf(\"%d \", i);\n}\nc\n\nMoreover, it is also possible to write an infinite loop without these parts at all:\n\nc\n\nfor (;;) {\n    // do something\n}\nc\n\nBut be very careful with such experiments; you need to clearly understand what you are doing and how to stop it!\n\n\\bold Nested loops\n\nIt's possible to nest one for loop inside another for loop. This approach is used to process multidimensional structures like tables (matrices), data cubes, and so on.\n\nFor example, the following code prints the multiplication table for numbers from 1 to 9 (inclusive).\n\nc\n\n#include <stdio.h>\n\nint main() {\n    for (int i = 1; i < 10; i++) {\n        for (int j = 1; j < 10; j++) {\n            printf(\"%d\\t\", i * j);\n        }\n        printf(\"\\n\");\n    }\n    return 0;\n}\nc\n\nIt outputs:\n(The multiplication table as in the original text)\n\nOne of the biggest challenges that beginner programmers often face with for loops (as well as other types of loops) is the off-by-one error. This error occurs when the loop iterates one time more or one time less than the desired number of iterations. It usually happens because an incorrect comparison operator is used in the loop condition (for example, > instead of >=, or vice versa). These errors are often difficult to detect as the compiler will not complain about them, and the program will run, but the results will be incorrect.\nWhen writing for loops, it's important to remember that the loop will continue executing as long as the condition is true. It is recommended to test loops using different values to verify their functionality. It is good practice to test loops with various input data (numbers, characters, etc.) that force the loop to execute 0, 1, and 2 times. If the loop operates correctly in these scenarios, then everything is okay.\n\n\\bold Rewritten code in C:\n\nExample 1: Printing numbers from 0 to 9\n\nc\n\n#include <stdio.h>\n\nint main() {\n    for (int i = 0; i < 10; i++) {\n        printf(\"%d \", i);\n    }\n    return 0;\n}\nc\n\nExample 2: Sum of numbers from 1 to 10000\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int sum = 0;\n    for (int i = 1; i <= 10000; i++) {\n        sum += i;\n    }\n    printf(\"The sum is: %d\\n\", sum);\n    return 0;\n}\nc\n\nExample 3: Printing the alphabet (4 letters per line)\n\nc\n\n#include <stdio.h>\n\nint main() {\n    char alphabet[] = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'};\n    int alphabetSize = sizeof(alphabet) / sizeof(alphabet[0]);\n    int lettersPerLine = 4;\n\n    for (int i = 0; i < alphabetSize; i++) {\n        printf(\"%c \", alphabet[i]);\n        if ((i + 1) % lettersPerLine == 0) {\n            printf(\"\\n\");\n        }\n    }\n    return 0;\n}\nc\n\nExample 4: Loop with a variable declared outside\n\nc\n\n#include <stdio.h>\n\nint main() {\n    int i = 10;\n    for (; i > 0; i--) {\n        printf(\"%d \", i);\n    }\n    return 0;\n}\nc\n\nExample 5: Multiplication table (nested loops)\n\nc\n\n#include <stdio.h>\n\nint main() {\n    for (int i = 1; i < 10; i++) {\n        for (int j = 1; j < 10; j++) {\n            printf(\"%d\\t\", i * j);\n        }\n        printf(\"\\n\");\n    }\n    return 0;\n}\nc",
  "isCompleted": true,
  "practice": null
}