{
  "id": "1",
  "title": "Introduction to programming and C history",
  "content": "Programming is the art of creating instructions for computers to execute.\n\nFor example, imagine you have a robot vacuum cleaner at home. By programming it, you can tell it how to navigate obstacles and clean your house efficiently. For instance, you can program it to move forward until it detects an obstacle, then turn in a different direction to avoid it and continue cleaning the rest of the area. With programming, we can create instructions that automate tasks and enable machines to perform complex actions, making our lives easier and more efficient.\n\nOne powerful language that has played a significant role in programming history is C. In this topic, we will provide an introduction to programming and explore the history and important features of C.\n\n\\bold What is C?\n\nC is a general-purpose, procedural programming language that was developed in the early 1970s by Dennis Ritchie at Bell Labs. It is one of the most widely used and influential programming languages in the history of computing.\n\n\\bold Areas of C Language Usage\n\nC is the foundational language of modern computing. Its unique combination of low-level control and high-performance capabilities makes it indispensable across numerous domains:\n\n- Operating Systems:\n\t- Windows, Linux, ...\n- Embedded Systems Engineering\n- High-Performance Applications:\n\t- Oracle\n\t- MySQL\n\t- SQL Server\n\t- PostgreSQL\n\t- MATLAB ...\n- Compilers and Interpreters:\n\t- Python\n\t- Ruby ...\n- Open-Source Software Revolution\n\n\\bold Key Characteristics of the C Language\n\nC is a relatively \"low-level\" language. It is \"small\" language with a single-pass compiler (passes the source code through each compilation module only once). Assumes that the programmer knows what they are doing\n\nThe C language is one that practically does not interfere with the programmer doing what they have decided to do. There is no \"nanny\" that follows you around and tries to \"prevent you from doing stupid things.\" After all, it's impossible to protect against all stupidities anyway.\n\nA program in the C language consists of one or more subroutines, called functions.\nThe C language is block-structured. Each block is enclosed in curly braces {}.\nThe main block in a console application program in the C language is the main function, named main().\nEvery action in the C language ends with a \"semicolon\" symbol — ;. An action can be a function call or the performance of some operations.\n\n\n",
  "isCompleted": true,
  "practice": null
}